zephyrproject-rtos/zephyr/drivers/usb/device/usb_dc_nrf5.c
	return true;
}

static struct nrf5_usbd_ep_ctx *endpoint_ctx(const u8_t ep)
{
	struct nrf5_usbd_ctx *ctx;
	u8_t ep_num;

	if (!ep_is_valid(ep)) {
		return NULL;
	}

	ctx = get_usbd_ctx();
	ep_num = NRF_USBD_EP_NR_GET(ep);

	if (NRF_USBD_EPIN_CHECK(ep)) {
		if (unlikely(NRF_USBD_EPISO_CHECK(ep))) {
			return &ctx->ep_ctx[EP_ISOIN_INDEX];
		} else {
			return &ctx->ep_ctx[ep_num];
		}
	} else {
		if (unlikely(NRF_USBD_EPISO_CHECK(ep))) {
			return &ctx->ep_ctx[EP_ISOOUT_INDEX];
		} else {
			return &ctx->ep_ctx[CFG_EPIN_CNT +
					    CFG_EP_ISOIN_CNT +
					    ep_num];
		}
	}

	return NULL;
}

static struct nrf5_usbd_ep_ctx *in_endpoint_ctx(const u8_t ep)
{
	return endpoint_ctx(NRF_USBD_EPIN(ep));
}

static struct nrf5_usbd_ep_ctx *out_endpoint_ctx(const u8_t ep)
{
	return endpoint_ctx(NRF_USBD_EPOUT(ep));
}

static void cfg_ep_interrupt(const u8_t ep, bool set)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();
	u8_t ep_num = NRF_USBD_EP_NR_GET(ep);
	u32_t mask = 0;

	if (NRF_USBD_EPIN_CHECK(ep)) {
		if (NRF_USBD_EPISO_CHECK(ep)) {
			mask |= (NRF_USBD_INT_ENDISOIN0_MASK |
				 NRF_USBD_INT_SOF_MASK);
		} else {
			mask |= BIT(ep_num + USBD_INTEN_ENDEPIN0_Pos);
			if (ep_num == 0) {
				mask |= NRF_USBD_INT_EP0DATADONE_MASK;
				mask |= NRF_USBD_INT_EP0SETUP_MASK;
			} else {
				mask |= NRF_USBD_INT_DATAEP_MASK;
			}
		}
	} else {
		if (NRF_USBD_EPISO_CHECK(ep)) {
			mask |= (NRF_USBD_INT_ENDISOOUT0_MASK |
				 NRF_USBD_INT_SOF_MASK);
		} else {
			mask |= BIT(ep_num + USBD_INTEN_ENDEPOUT0_Pos);
			if (ep_num == 0) {
				mask |= NRF_USBD_INT_EP0DATADONE_MASK;
				mask |= NRF_USBD_INT_EP0SETUP_MASK;
			} else {
				mask |= NRF_USBD_INT_DATAEP_MASK;
			}
		}
	}

	irq_disable(CONFIG_USBD_NRF5_IRQ);

	if (set) {
		mask |= NRF_USBD_INT_STARTED_MASK;
		nrf_usbd_int_enable(mask);
	} else {
		nrf_usbd_int_disable(mask);
	}

	ctx->enable_mask = nrf_usbd_int_enable_get();

	irq_enable(CONFIG_USBD_NRF5_IRQ);
}

static struct nrf5_usbd_ep_ctx *epstatus_to_ep_ctx(u32_t epstatus)
{
	int pos;
	u8_t ep = 0;

	/**
	 * TODO: Is it possible for multiple bits to be set?
	 * When debug logs are enabled, they cause delays in
	 * handling the ISR and possibly multiple EP status
	 * or EPDATA status were set. If this is common, we
	 * may have to handle them all here by allocating
	 * multiple events and queue them up to the FIFO.
	 */
	if (popcount(epstatus) > 1) {
		SYS_LOG_ERR("%d bits set in epstatus!!",
			    popcount(epstatus));
		__ASSERT_NO_MSG(0);
	}

	if (epstatus & USBD_EPSTATUS_EPIN_MASK) {
		pos = USBD_EPSTATUS_EPIN0_Pos;

		while (pos <= USBD_EPSTATUS_EPIN8_Pos) {
			if (epstatus & BIT(pos)) {
				ep = NRF_USBD_EPIN(pos);
				return endpoint_ctx(ep);
			}
			pos++;
		}
	}

	if (epstatus & USBD_EPSTATUS_EPOUT_MASK) {
		pos = USBD_EPSTATUS_EPOUT0_Pos;

		while (pos <= USBD_EPSTATUS_EPOUT8_Pos) {
			if (epstatus & BIT(pos)) {
				ep = NRF_USBD_EPOUT(pos -
						    USBD_EPSTATUS_EPOUT0_Pos);
				return endpoint_ctx(ep);
			}
			pos++;
		}
	}

	SYS_LOG_ERR("invalid epstatus 0x%08x", epstatus);
	__ASSERT_NO_MSG(0);

	return NULL;
}

static struct nrf5_usbd_ep_ctx *epdatastatus_to_ep_ctx(u32_t epdatastatus)
{
	int pos;
	u8_t ep = 0;

	/**
	 * TODO: Is it possible for multiple bits to be set?
	 * When debug logs are enabled, they cause delays in
	 * handling the ISR and possibly multiple EP status
	 * or EPDATA status were set. If this is common, we
	 * may have to handle them all here by allocating
	 * multiple events and queue them up to the FIFO.
	 */
	if (popcount(epdatastatus) > 1) {
		SYS_LOG_ERR("%d bits set in epdatastatus!!",
			    popcount(epdatastatus));
		__ASSERT_NO_MSG(0);
	}

	if (epdatastatus & USBD_EPDATASTATUS_EPIN_MASK) {
		pos = USBD_EPDATASTATUS_EPIN1_Pos;

		while (pos <= USBD_EPDATASTATUS_EPIN7_Pos) {
			if (epdatastatus & BIT(pos)) {
				ep = NRF_USBD_EPIN(pos);
				return endpoint_ctx(ep);
			}
			pos++;
		}
	}

	if (epdatastatus & USBD_EPDATASTATUS_EPOUT_MASK) {
		pos = USBD_EPDATASTATUS_EPOUT1_Pos;

		while (pos <= USBD_EPDATASTATUS_EPOUT7_Pos) {
			if (epdatastatus & BIT(pos)) {
				ep = NRF_USBD_EPOUT(pos -
						    USBD_EPSTATUS_EPOUT0_Pos);
				return endpoint_ctx(ep);
			}
			pos++;
		}
	}

	SYS_LOG_ERR("invalid epdatastatus 0x%08x", epdatastatus);
	__ASSERT_NO_MSG(0);

	return NULL;
}

static void start_epin_task(u8_t ep)
{
	u8_t epnum = NRF_USBD_EP_NR_GET(ep);
	nrf_usbd_task_t task;

	if (NRF_USBD_EPOUT_CHECK(ep)) {
		SYS_LOG_ERR("invalid endpoint!");
		return;
	}

	if (epnum > NRF_USBD_EPIN_CNT) {
		SYS_LOG_ERR("invalid endpoint %d", epnum);
		return;
	}

	task = NRF_USBD_TASK_STARTEPIN0 + (epnum * sizeof(u32_t));
	nrf_usbd_task_trigger(task);
}

static void start_epout_task(u8_t ep)
{
	u8_t epnum = NRF_USBD_EP_NR_GET(ep);
	nrf_usbd_task_t task;

	if (NRF_USBD_EPIN_CHECK(ep)) {
		SYS_LOG_ERR("invalid endpoint!");
		return;
	}

	if (epnum > NRF_USBD_EPOUT_CNT) {
		SYS_LOG_ERR("invalid endpoint %d", epnum);
		return;
	}

	task = NRF_USBD_TASK_STARTEPOUT0 + (epnum * sizeof(u32_t));
	nrf_usbd_task_trigger(task);
}

static void start_ep0rcvout_task(void)
{
	nrf_usbd_task_trigger(NRF_USBD_TASK_EP0RCVOUT);
}

static void start_ep0status_task(void)
{
	nrf_usbd_task_trigger(NRF_USBD_TASK_EP0STATUS);
}

static void start_ep0stall_task(void)
{
	nrf_usbd_task_trigger(NRF_USBD_TASK_EP0STALL);
}

static inline struct ep_usb_event *alloc_ep_usb_event(void)
{
	int ret;
	struct ep_usb_event *ev;
	struct k_mem_block block;

	ret = k_mem_pool_alloc(&fifo_elem_pool, &block,
			       sizeof(struct ep_usb_event),
			       K_NO_WAIT);
	if (ret < 0) {
		SYS_LOG_DBG("ep usb event alloc failed!");
		__ASSERT_NO_MSG(0);
		return NULL;
	}

	ev = (struct ep_usb_event *)block.data;
	memcpy(&ev->block, &block, sizeof(block));
	ev->misc_u.flags = 0;

	return ev;
}

static inline void free_ep_usb_event(struct ep_usb_event *ev)
{
	k_mem_pool_free(&ev->block);
}

static inline void enqueue_ep_usb_event(struct ep_usb_event *ev)
{
	k_fifo_put(&get_usbd_ctx()->work_queue, ev);
}

static inline struct ep_usb_event *dequeue_ep_usb_event(void)
{
	return k_fifo_get(&get_usbd_ctx()->work_queue, K_NO_WAIT);
}

static inline void flush_ep_usb_events(void)
{
	struct ep_usb_event *ev;

	do {
		ev = dequeue_ep_usb_event();
		if (ev) {
			free_ep_usb_event(ev);
		}
	} while (ev != NULL);
}

/** Interrupt mask to event register map */
#define USBD_INT_CNT 25

static const u32_t event_map[USBD_INT_CNT] = {
	NRF_USBD_EVENT_USBRESET,
	NRF_USBD_EVENT_STARTED,
	NRF_USBD_EVENT_ENDEPIN0,
	NRF_USBD_EVENT_ENDEPIN1,
	NRF_USBD_EVENT_ENDEPIN2,
	NRF_USBD_EVENT_ENDEPIN3,
	NRF_USBD_EVENT_ENDEPIN4,
	NRF_USBD_EVENT_ENDEPIN5,
	NRF_USBD_EVENT_ENDEPIN6,
	NRF_USBD_EVENT_ENDEPIN7,
	NRF_USBD_EVENT_EP0DATADONE,
	NRF_USBD_EVENT_ENDISOIN0,
	NRF_USBD_EVENT_ENDEPOUT0,
	NRF_USBD_EVENT_ENDEPOUT1,
	NRF_USBD_EVENT_ENDEPOUT2,
	NRF_USBD_EVENT_ENDEPOUT3,
	NRF_USBD_EVENT_ENDEPOUT4,
	NRF_USBD_EVENT_ENDEPOUT5,
	NRF_USBD_EVENT_ENDEPOUT6,
	NRF_USBD_EVENT_ENDEPOUT7,
	NRF_USBD_EVENT_ENDISOOUT0,
	NRF_USBD_EVENT_SOF,
	NRF_USBD_EVENT_USBEVENT,
	NRF_USBD_EVENT_EP0SETUP,
	NRF_USBD_EVENT_DATAEP,
};

