zephyrproject-rtos/zephyr/drivers/usb/device/usb_dc_nrf5.c
static void usb_reset_handler(u32_t pos)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();

	ARG_UNUSED(pos);

	ctx->status_code = USB_DC_RESET;
	ctx->flags |= BIT(NRF5_USB_STATUS_CHANGE);
}

static void usb_started_handler(u32_t pos)
{
	u32_t epstatus = nrf_usbd_epstatus_get_and_clear();
	struct ep_usb_event *ev;

	ARG_UNUSED(pos);

	ev = alloc_ep_usb_event();
	ev->ep = epstatus_to_ep_ctx(epstatus);
	ev->evt = EP_DMA_START;

	enqueue_ep_usb_event(ev);
}

static void end_epin_handler(u32_t pos)
{
	struct ep_usb_event *ev;
	u8_t ep;

	ep = NRF_USBD_EPIN(pos - (u8_t)USBD_INTEN_ENDEPIN0_Pos);

	ev = alloc_ep_usb_event();
	ev->ep = endpoint_ctx(ep);
	ev->evt = EP_DMA_END;

	enqueue_ep_usb_event(ev);
}

static void ep0_datadone_handler(u32_t pos)
{
	struct ep_usb_event *ev;
	u8_t ep = NRF_USBD_EPIN(0);

	ARG_UNUSED(pos);

	ev = alloc_ep_usb_event();
	ev->ep = endpoint_ctx(ep);

	/* See if this is IN or OUT event */
	if (ev->ep->state == EP_DATA) {
		ev->evt = EP_WRITE_COMPLETE;
	} else {
		ep = NRF_USBD_EPOUT(0);

		ev->ep = endpoint_ctx(ep);
		/**
		 * This is just an indication of OUT data received into
		 * local buffer. We need to trigger DMA in work handler.
		 */
		ev->evt = EP_DATA_RECV;
	}

	enqueue_ep_usb_event(ev);
}

static void end_isoin_handler(u32_t pos)
{
	struct ep_usb_event *ev;
	u8_t ep;

	ARG_UNUSED(pos);
	ep = NRF_USBD_EPIN(NRF_USBD_EPISO_FIRST);

	ev = alloc_ep_usb_event();
	ev->ep = endpoint_ctx(ep);
	ev->evt = EP_DMA_END;

	enqueue_ep_usb_event(ev);
}

static void end_epout_handler(u32_t pos)
{
	struct ep_usb_event *ev;
	u8_t ep;

	ep = NRF_USBD_EPOUT(pos - (u8_t)USBD_INTEN_ENDEPOUT0_Pos);

	ev = alloc_ep_usb_event();
	ev->ep = endpoint_ctx(ep);
	ev->ep->buf.len = nrf_usbd_ep_amount_get(ep);
	ev->evt = EP_DMA_END;

	ev->misc_u.flags |= BIT(EP_OUT_DATA_RCVD);

	enqueue_ep_usb_event(ev);
}

static void end_isoout_handler(u32_t pos)
{
	struct ep_usb_event *ev;
	u8_t ep;

	ARG_UNUSED(pos);

	/* TODO: Handle the CRC error case here */
	ep = NRF_USBD_EPOUT(NRF_USBD_EPISO_FIRST);

	ev = alloc_ep_usb_event();
	ev->ep = endpoint_ctx(ep);
	ev->ep->buf.len = nrf_usbd_ep_amount_get(ep);
	ev->evt = EP_DMA_END;

	enqueue_ep_usb_event(ev);
}

static void sof_handler(u32_t pos)
{
	struct ep_usb_event *ev;

	ARG_UNUSED(pos);

	ev = alloc_ep_usb_event();
	/* TODO: How to know if this is for ISOIN or ISOOUT? */
	ev->ep = NULL;
	ev->evt = EP_SOF;
	ev->misc_u.frame_counter = nrf_usbd_framecntr_get();

	enqueue_ep_usb_event(ev);
}

static void usb_event_handler(u32_t pos)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();
	u32_t eventcause;

	ARG_UNUSED(pos);
	eventcause = nrf_usbd_eventcause_get_and_clear();

	if (eventcause & NRF_USBD_EVENTCAUSE_READY_MASK) {
		/* TODO: Should we mark this somewhere? */
	} else if (eventcause & NRF_USBD_EVENTCAUSE_ISOOUTCRC_MASK) {
		/* TODO: Handle the CRC error case properly */
	} else if (eventcause & NRF_USBD_EVENTCAUSE_SUSPEND_MASK) {
		/* TODO: Add protection to discard write during suspend */
		ctx->status_code = USB_DC_SUSPEND;
		ctx->flags |= BIT(NRF5_USB_STATUS_CHANGE);
	} else if (eventcause & NRF_USBD_EVENTCAUSE_RESUME_MASK) {
		/* TODO: Take care of resume properly */
		ctx->status_code = USB_DC_RESUME;
		ctx->flags |= BIT(NRF5_USB_STATUS_CHANGE);
	}
}

static void ep0setup_handler(u32_t pos)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;
	struct usb_setup_packet *setup;
	struct ep_usb_event *ev;
	u8_t ep = NRF_USBD_EPOUT(0);

	ARG_UNUSED(pos);

	ep_ctx = endpoint_ctx(ep);

	if (ep_ctx->buf.len) {
		/**
		 * Pending device stack read
		 * This is happening during SET ADDRESS.
		 * From what it seems, the HW completes the STATUS stage for
		 * SET ADDR transaction even before software processes it.
		 * TODO: Find out if we can avoid this.
		 */
		return;
	}

	setup = (struct usb_setup_packet *)ep_ctx->buf.data;

	setup->bmRequestType = nrf_usbd_setup_bmrequesttype_get();
	setup->bRequest = nrf_usbd_setup_brequest_get();
	setup->wValue = nrf_usbd_setup_wvalue_get();
	setup->wIndex = nrf_usbd_setup_windex_get();
	setup->wLength = nrf_usbd_setup_wlength_get();

	ep_ctx->buf.len = sizeof(*setup);

	ev = alloc_ep_usb_event();
	ev->ep = ep_ctx;
	ev->evt = EP_SETUP_RECV;

	if (REQTYPE_GET_DIR(setup->bmRequestType) == REQTYPE_DIR_TO_DEVICE) {
		if (setup->wLength) {
			ev->misc_u.flags |= BIT(EP_CONTROL_WRITE);
		} else {
			ev->misc_u.flags |= BIT(EP_CONTROL_WRITE_NO_DATA);
		}
	} else {
		ev->misc_u.flags |= BIT(EP_CONTROL_READ);
	}

	enqueue_ep_usb_event(ev);
}

static void epdata_handler(u32_t pos)
{
	struct ep_usb_event *ev;
	u32_t epdatastatus;

	ARG_UNUSED(pos);
	epdatastatus = nrf_usbd_epdatastatus_get_and_clear();

	ev = alloc_ep_usb_event();
	ev->ep = epdatastatus_to_ep_ctx(epdatastatus);
	if (NRF_USBD_EPIN_CHECK(ev->ep->cfg.addr)) {
		ev->evt = EP_WRITE_COMPLETE;
	} else {
		ev->evt = EP_DATA_RECV;
	}

	ev->misc_u.flags = 0;

	enqueue_ep_usb_event(ev);
}

typedef void (*isr_event_handler_t)(u32_t pos);

static const isr_event_handler_t isr_event_handlers[USBD_INT_CNT] = {
	usb_reset_handler,
	usb_started_handler,
	end_epin_handler,
	end_epin_handler,
	end_epin_handler,
	end_epin_handler,
	end_epin_handler,
	end_epin_handler,
	end_epin_handler,
	end_epin_handler,
	ep0_datadone_handler,
	end_isoin_handler,
	end_epout_handler,
	end_epout_handler,
	end_epout_handler,
	end_epout_handler,
	end_epout_handler,
	end_epout_handler,
	end_epout_handler,
	end_epout_handler,
	end_isoout_handler,
	sof_handler,
	usb_event_handler,
	ep0setup_handler,
	epdata_handler,
};

/** Process interrupts that are enabled */
static u32_t process_interrupts(u32_t mask)
{
	u32_t processed = 0, pos = 0;
	isr_event_handler_t evt_hdlr;

	while (pos < USBD_INT_CNT) {
		if (!(mask & BIT(pos))) {
			pos++;
			continue;
		}

		if (nrf_usbd_event_check(event_map[pos])) {
			nrf_usbd_event_clear(event_map[pos]);

			evt_hdlr = isr_event_handlers[pos];
			if (evt_hdlr) {
				evt_hdlr(pos);
				processed++;
			}
		}
		pos++;
	}

	return processed;
}

/**
 * @brief Interrupt service routine.
 *
 * This handles the USBD interrupt
 *
 * @param arg Argument to ISR.
 *
 * @return N/A
 */
static void usbd_isr_handler(void *arg)
{
	struct nrf5_usbd_ctx *ctx = arg;

