zephyrproject-rtos/zephyr/drivers/usb/device/usb_dc_nrf5.c
	if (!ctx->enabled) {
		return;
	}

	irq_disable(CONFIG_USBD_NRF5_IRQ);

	if (process_interrupts(ctx->enable_mask)) {
		if (!k_work_pending(&ctx->usb_work)) {
			k_work_submit(&ctx->usb_work);
		}
	}

	irq_enable(CONFIG_USBD_NRF5_IRQ);
}

/**
 * @brief Install the Interrupt service routine.
 *
 * This installs the interrupt service routine and enables the USBD interrupt.
 *
 * @return N/A
 */
static void usbd_install_isr(void)
{
	IRQ_CONNECT(CONFIG_USBD_NRF5_IRQ,
		    CONFIG_USBD_NRF5_IRQ_PRI,
		    usbd_isr_handler, &usbd_ctx, 0);
}

static void usbd_enable_interrupts(void)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();

	ctx->enable_mask = NRF_USBD_INT_USBRESET_MASK |
			   NRF_USBD_INT_USBEVENT_MASK |
			   NRF_USBD_INT_DATAEP_MASK;

	nrf_usbd_int_enable(ctx->enable_mask);
	ctx->enabled = true;

	irq_enable(CONFIG_USBD_NRF5_IRQ);
}

static void usbd_disable_interrupts(void)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();

	nrf_usbd_int_disable(~0);
	ctx->enabled = false;
	irq_disable(CONFIG_USBD_NRF5_IRQ);
}

void nrf5_usbd_power_event_callback(nrf_power_event_t event)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();

	switch (event) {
	case NRF_POWER_EVENT_USBDETECTED:
		ctx->state = USBD_ATTACHED;
		break;
	case NRF_POWER_EVENT_USBPWRRDY:
		ctx->state = USBD_POWERED;
		break;
	case NRF_POWER_EVENT_USBREMOVED:
		ctx->state = USBD_DETACHED;
		break;
	default:
		SYS_LOG_DBG("Unknown USB event");
		return;
	}

	ctx->flags |= BIT(NRF5_USB_STATE_CHANGE);
	k_work_submit(&ctx->usb_work);
}

/**
 * @brief Enable/Disable the HF clock
 *
 * Toggle the HF clock. It needs to be enabled for USBD data exchange
 *
 * @param on		Set true to enable the HF clock, false to disable.
 * @param blocking	Set true to block wait till HF clock stabilizes.
 *
 * @return 0 on success, error number otherwise
 */
static int hf_clock_enable(bool on, bool blocking)
{
	int ret = -ENODEV;
	struct device *clock;

	clock = device_get_binding(CONFIG_CLOCK_CONTROL_NRF5_M16SRC_DRV_NAME);
	if (!clock) {
		SYS_LOG_ERR("NRF5 HF Clock device not found!");
		return ret;
	}

	if (on) {
		ret = clock_control_on(clock, (void *)blocking);
	} else {
		ret = clock_control_off(clock, (void *)blocking);
	}

	if (ret) {
		SYS_LOG_ERR("NRF5 HF clock %s fail: %d",
			    on ? "start" : "stop", ret);
		return ret;
	}

	SYS_LOG_DBG("HF clock %s success", on ? "start" : "stop");

	return ret;
}

static void usbd_enable_endpoints(struct nrf5_usbd_ctx *ctx)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;
	int i;

	for (i = 0; i < NRF_USBD_EPIN_CNT; i++) {
		ep_ctx = in_endpoint_ctx(i);
		__ASSERT_NO_MSG(ep_ctx);

		if (ep_ctx->cfg.en) {
			nrf_usbd_ep_enable(ep_ctx->cfg.addr);
			cfg_ep_interrupt(ep_ctx->cfg.addr, true);
		}
	}

	for (i = 0; i < NRF_USBD_EPOUT_CNT; i++) {
		ep_ctx = out_endpoint_ctx(i);
		__ASSERT_NO_MSG(ep_ctx);

		if (ep_ctx->cfg.en) {
			nrf_usbd_ep_enable(ep_ctx->cfg.addr);
			cfg_ep_interrupt(ep_ctx->cfg.addr, true);
			nrf_usbd_epout_clear(ep_ctx->cfg.addr);
		}
	}
}

static void usbd_handle_state_change(struct nrf5_usbd_ctx *ctx)
{
	switch (ctx->state) {
	case USBD_ATTACHED:
		SYS_LOG_DBG("USB detected");
		nrf_usbd_enable();
		break;
	case USBD_POWERED:
		SYS_LOG_DBG("USB Powered");
		ctx->status_code = USB_DC_CONNECTED;
		ctx->flags |= BIT(NRF5_USB_STATUS_CHANGE);
		usbd_enable_endpoints(ctx);
		nrf_usbd_pullup_enable();
		ctx->ready = true;
		break;
	case USBD_DETACHED:
		SYS_LOG_DBG("USB Removed");
		if (nrf_usbd_pullup_check()) {
			nrf_usbd_pullup_disable();
			ctx->ready = false;
		}
		nrf_usbd_disable();
		ctx->status_code = USB_DC_DISCONNECTED;
		ctx->flags |= BIT(NRF5_USB_STATUS_CHANGE);
		break;
	default:
		SYS_LOG_ERR("Unknown USB state");
	}

	if (ctx->flags) {
		k_work_submit(&ctx->usb_work);
	}
}

static void usbd_handle_status_change(struct nrf5_usbd_ctx *ctx)
{
	if (ctx->status_cb) {
		ctx->status_cb(ctx->status_code, NULL);
	}
}

/* Control read/write: Handle the HW events during IDLE state */
static inline void handle_ctrl_ep_idle_state_events(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ev->evt) {
	case EP_SETUP_RECV:
		if (ev->misc_u.flags & BIT(EP_CONTROL_READ)) {
			struct nrf5_usbd_ep_ctx *epin0;

			/**
			 * SETUP packet comes through CTRL EPOUT0
			 * and control read data stage happens in CTRL
			 * EPIN0. So, go back to IDLE state in EPOUT0.
			 */
			ep_ctx->state = EP_IDLE;

			/* Prepare EPIN0 for DATA stage */
			epin0 = endpoint_ctx(NRF_USBD_EPIN(0));
			epin0->state = EP_DATA;
		} else if (ev->misc_u.flags & BIT(EP_CONTROL_WRITE)) {
			ep_ctx->state = EP_SETUP;

			/**
			 * Initiate reception of EP0 OUT DATA to USBD
			 * local buffer
			 */
			start_ep0rcvout_task();
		} else if (ev->misc_u.flags & BIT(EP_CONTROL_WRITE_NO_DATA)) {
			/* No DATA stage. Be in IDLE state. Redundant. */
			ep_ctx->state = EP_IDLE;
		}

		/* Inform the stack */
		ep_ctx->cfg.cb(ep_ctx->cfg.addr, USB_DC_EP_SETUP);
		break;

	case EP_DATA_RECV:
	case EP_DMA_START:
	case EP_DMA_END:
	case EP_WRITE_COMPLETE:
	case EP_SOF:
		SYS_LOG_ERR("invalid event %d in data state for EP %d",
			    ev->evt, ep_ctx->cfg.addr);
		__ASSERT_NO_MSG(0);
		break;
	}
}

/* Control read/write: Handle the HW events during SETUP stage */
static inline void handle_ctrl_ep_setup_state_events(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ev->evt) {
	case EP_DATA_RECV:
	{
		struct nrf5_usbd_ctx *ctx = get_usbd_ctx();

		/**
		 * We have received OUT data on EPOUT0 which is in USBD's local
		 * buffer. Grab it into endpoint's buffer with EasyDMA.
		 */
		nrf_usbd_ep_easydma_set(ep_ctx->cfg.addr,
					(u32_t)ep_ctx->buf.data,
					ep_ctx->buf.len);

		/* Only one DMA operation can happen at a time */
		k_sem_take(&ctx->dma_in_use, K_FOREVER);

		start_epout_task(ep_ctx->cfg.addr);

		/* Move to DATA stage */
		ep_ctx->state = EP_DATA;
	}
		break;
	case EP_SETUP_RECV:
	case EP_DMA_START:
	case EP_DMA_END:
	case EP_WRITE_COMPLETE:
	case EP_SOF:
		SYS_LOG_ERR("invalid event %d in setup state", ev->evt);
		__ASSERT_NO_MSG(0);
		break;
	}
}

