zephyrproject-rtos/zephyr/drivers/usb/device/usb_dc_nrf5.c
/* Control read/write: Handle the HW events during data stage */
static inline void handle_ctrl_ep_data_state_events(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ev->evt) {
	case EP_DMA_START:
		/* Nothing much to do here */
		break;
	case EP_DMA_END:
		/**
		 * EasyDMA can now be used by other threads
		 * possibly waiting for DMA time.
		 */
		k_sem_give(&ctx->dma_in_use);

		/**
		 * If this is an OUT data indication, indicate the device stack
		 * to read from the endpoint buffer.
		 */
		if (ev->misc_u.flags & BIT(EP_OUT_DATA_RCVD)) {
			if (ep_ctx->buf.len < ep_ctx->cfg.max_sz) {
				/**
				 * ZLP or short packet? Initiate STATUS stage
				 * TODO: Should we do this here or in read()?
				 */
				start_ep0status_task();
				ep_ctx->state = EP_IDLE;
			} else {
				/* We have some more OUT data to receive */
				/* TODO: What if it's exact multiple of MPS? */
				start_ep0rcvout_task();
			}

			/* Inform the device stack */
			ep_ctx->cfg.cb(ep_ctx->cfg.addr, USB_DC_EP_DATA_OUT);
		}
		break;
	case EP_WRITE_COMPLETE:
		/**
		 * ZLP or short packet? Initiate STATUS stage
		 * TODO: Should we do this here or during write (0)?
		 * TODO: What if the data is actually a multiple of max_sz??
		 */
		if (ep_ctx->buf.len < ep_ctx->cfg.max_sz) {
			start_ep0status_task();
			ep_ctx->state = EP_IDLE;
		}

		/* Indicate write completion to the device stack */
		ep_ctx->cfg.cb(ep_ctx->cfg.addr, USB_DC_EP_DATA_IN);
		break;
	case EP_DATA_RECV:
		/**
		 * We have received OUT data on EPOUT0.
		 * Grab it into endpoint buffer with EasyDMA.
		 */
		nrf_usbd_ep_easydma_set(ep_ctx->cfg.addr,
					(u32_t)ep_ctx->buf.data,
					ep_ctx->buf.len);

		/* Only one DMA can happen at a time */
		k_sem_take(&ctx->dma_in_use, K_FOREVER);
		start_epout_task(ep_ctx->cfg.addr);
		break;
	case EP_SETUP_RECV:
	case EP_SOF:
		SYS_LOG_ERR("invalid event %d in data state for EP %d",
			    ev->evt, ep_ctx->cfg.addr);
		__ASSERT_NO_MSG(0);
		break;
	}
}

/* Handle all control endpoint events */
static void handle_ctrl_ep_event(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ep_ctx->state) {
	case EP_IDLE:
		handle_ctrl_ep_idle_state_events(ev);
		break;
	case EP_SETUP:
		handle_ctrl_ep_setup_state_events(ev);
		break;
	case EP_DATA:
		handle_ctrl_ep_data_state_events(ev);
		break;
	case EP_STATUS:
		/**
		 * TODO: HW doesn't indicate STATUS stage completion to SW.
		 * Do we even need STATUS state?
		 */
		break;
	}
}

/* Data IN/OUT: Handle the HW events during IDLE state */
static inline void handle_data_ep_idle_state_events(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ev->evt) {
	case EP_DMA_START:
		/**
		 * For IN endpoints, application has initiated a write.
		 * For OUT endpoints work handler must've initiated EPOUT task
		 * Either way, move the state to DATA.
		 */
		ep_ctx->state = EP_DATA;
		break;
	case EP_DATA_RECV:
	{
		struct nrf5_usbd_ctx *ctx = get_usbd_ctx();
		u8_t addr = ep_ctx->cfg.addr;

		/**
		 * We have some OUT BULK/INTERRUT data received
		 * into the USBD's local buffer. Let's grab it.
		 */
		nrf_usbd_ep_easydma_set(addr, (u32_t)ep_ctx->buf.data,
					nrf_usbd_epout_size_get(addr));

		/* Only one DMA can happen at a time */
		k_sem_take(&ctx->dma_in_use, K_FOREVER);
		start_epout_task(addr);
	}
		break;
	case EP_WRITE_COMPLETE:
	case EP_DMA_END:
	case EP_SETUP_RECV:
	case EP_SOF:
		SYS_LOG_ERR("invalid event %d in idle state", ev->evt);
		__ASSERT_NO_MSG(0);
		break;
	}
}

/* Data IN/OUT: Handle the HW events during DATA state */
static inline void handle_data_ep_data_state_events(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ev->evt) {
	case EP_DMA_END:
	{
		struct nrf5_usbd_ctx *ctx = get_usbd_ctx();

		/**
		 * EasyDMA can now be used by other threads
		 * possibly waiting for DMA time.
		 */
		if (NRF_USBD_EPIN_CHECK(ep_ctx->cfg.addr)) {
			ep_ctx->flags |= BIT(EP_WRITE_PENDING);
		}
		k_sem_give(&ctx->dma_in_use);

		if (NRF_USBD_EPOUT_CHECK(ep_ctx->cfg.addr)) {
			/**
			 * We've received the OUT data in the endpoint buffer
			 * Inform upper layer.
			 */
			ep_ctx->cfg.cb(ep_ctx->cfg.addr, USB_DC_EP_DATA_OUT);

			/**
			 * Move back to IDLE state
			 * TODO: Should we do this in read() instead?
			 */
			ep_ctx->state = EP_IDLE;
		}
	}
		break;
	case EP_WRITE_COMPLETE:
	{
		ep_ctx->flags &= ~BIT(EP_WRITE_PENDING);

		/* Inform stack and go back to IDLE state */
		ep_ctx->cfg.cb(ep_ctx->cfg.addr, USB_DC_EP_DATA_IN);
		ep_ctx->state = EP_IDLE;
	}
		break;
	case EP_DATA_RECV:
	case EP_DMA_START:
	case EP_SETUP_RECV:
	case EP_SOF:
		SYS_LOG_ERR("invalid event %d in data state", ev->evt);
		__ASSERT_NO_MSG(0);
		break;
	}
}

/* Handle all data (Bulk/Interrupt) endpoint events */
static void handle_data_ep_event(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ep_ctx->state) {
	case EP_IDLE:
		handle_data_ep_idle_state_events(ev);
		break;
	case EP_DATA:
		handle_data_ep_data_state_events(ev);
		break;
	case EP_SETUP:
	case EP_STATUS:
		SYS_LOG_ERR("invalid state(%d) for data ep %d",
			    ep_ctx->state, ep_ctx->cfg.addr);
		break;
	}
}

/* ISO IN/OUT: Handle the HW events during IDLE state - WIP */
static inline void handle_iso_ep_idle_state_events(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ev->evt) {
	case EP_SOF:
	{
		struct nrf5_usbd_ctx *ctx = get_usbd_ctx();
		u8_t addr = ep_ctx->cfg.addr;

		if (NRF_USBD_EPOUT_CHECK(ep_ctx->cfg.addr)) {
			/**
			 * TODO: We should check the ISOCRC USB flag here and
			 * discard the whole data after DMA if need be. USBD
			 * will transfer the OUT data anyway if DMA is set up.
			 */

			/** Is buffer available? */
			if (!ep_ctx->buf.len) {
				u32_t maxcnt;

				maxcnt = nrf_usbd_episoout_size_get(addr);
				nrf_usbd_ep_easydma_set(addr,
							(u32_t)ep_ctx->buf.data,
							maxcnt);

				/* Only one DMA can happen at a time */
				k_sem_take(&ctx->dma_in_use, K_FOREVER);
				start_epout_task(addr);
			}
		} else {
			/**
			 * Have anything in the ISO IN buffer to write to
			 * USB bus?
			 */
			if (ep_ctx->buf.len) {
				nrf_usbd_ep_easydma_set(addr,
							(u32_t)ep_ctx->buf.data,
							ep_ctx->cfg.max_sz);

				/**
				 * TODO: What if we are stuck in this work
				 * handler forever?
				 * Because, a DMA done event would be waiting
				 * in the FIFO forever. Should we instead give
				 * the sem back in ISR?
				 */
				k_sem_take(&ctx->dma_in_use, K_FOREVER);
				start_epin_task(addr);
			}
		}
	}
		break;
	case EP_DMA_START:
		/**
		 * For IN endpoints, application has initiated a write.
		 * For OUT endpoints work handler must've initiated EPOUT task
		 * Either way, move the state to DATA.
		 */
		ep_ctx->state = EP_DATA;
		break;
	case EP_WRITE_COMPLETE:
	case EP_DMA_END:
	case EP_SETUP_RECV:
	case EP_DATA_RECV:
		SYS_LOG_ERR("invalid event %d in idle state", ev->evt);
		__ASSERT_NO_MSG(0);
		break;
	}
}

/* ISO IN/OUT: Handle the HW events during DATA state */
static inline void handle_iso_ep_data_state_events(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	switch (ev->evt) {
	case EP_DMA_END:
		if (NRF_USBD_EPOUT_CHECK(ep_ctx->cfg.addr)) {
			/**
			 * We've received ISO OUT data. Indicate upper layer.
			 * Usually the buffer should be consumed all at once.
			 */
			ep_ctx->cfg.cb(ep_ctx->cfg.addr, USB_DC_EP_DATA_OUT);
		} else {
			/**
			 * This is not an actual write complete perse.
			 * An implicit write complete callback. So to speak.
			 */
			ep_ctx->cfg.cb(ep_ctx->cfg.addr, USB_DC_EP_DATA_IN);
		}

		/* Move back to IDLE state */
		ep_ctx->state = EP_IDLE;
		break;
	case EP_DATA_RECV:
	case EP_SOF:
	case EP_DMA_START:
	case EP_WRITE_COMPLETE:
	case EP_SETUP_RECV:
		SYS_LOG_ERR("invalid event %d in idle state", ev->evt);
		__ASSERT_NO_MSG(0);
		break;
	}
}

/* Handle all isochronous endpoint events - WIP */
static void handle_iso_ep_event(struct ep_usb_event *ev)
{
	struct nrf5_usbd_ep_ctx *ep_ctx = ev->ep;

	/**
	 * TODO:
	 * How to differentiate an SOF between IN and OUT endpoints?
	 * Right now we don't have the endpoint context set in ISR.
	 * So, just don't handle it for now.
	 */
	if (!ep_ctx) {
		return;
	}

