zephyrproject-rtos/zephyr/drivers/usb/device/usb_dc_nrf5.c
	return 0;
}

int usb_dc_ep_set_stall(const u8_t ep)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	switch (ep_ctx->cfg.type) {
	case USB_DC_EP_CONTROL:
		start_ep0stall_task();
		break;
	case USB_DC_EP_BULK:
	case USB_DC_EP_INTERRUPT:
		nrf_usbd_ep_stall(ep);
		break;
	case USB_DC_EP_ISOCHRONOUS:
		SYS_LOG_ERR("STALL unsupported on ISO endpoints");
		return -EINVAL;
	}

	ep_ctx->state = EP_IDLE;
	ep_ctx->buf.len = 0;
	ep_ctx->buf.curr = ep_ctx->buf.data;
	ep_ctx->flags = 0;

	return 0;
}

int usb_dc_ep_clear_stall(const u8_t ep)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	nrf_usbd_ep_unstall(ep);

	return 0;
}

int usb_dc_ep_halt(const u8_t ep)
{
	return usb_dc_ep_set_stall(ep);
}

int usb_dc_ep_is_stalled(const u8_t ep, u8_t *const stalled)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	*stalled = (u8_t)nrf_usbd_ep_is_stall(ep);

	return 0;
}

int usb_dc_ep_enable(const u8_t ep)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	if (ep_ctx->cfg.en) {
		return -EALREADY;
	}

	ep_ctx->cfg.en = true;

	/* Defer the endpoint enable if USBD is not ready yet */
	if (dev_ready()) {
		nrf_usbd_ep_enable(ep);
		cfg_ep_interrupt(ep, true);

		if (NRF_USBD_EPOUT_CHECK(ep)) {
			nrf_usbd_epout_clear(ep);
		}
	}

	return 0;
}

int usb_dc_ep_disable(const u8_t ep)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	if (!ep_ctx->cfg.en) {
		return -EALREADY;
	}

	cfg_ep_interrupt(ep, false);
	nrf_usbd_ep_disable(ep);
	ep_ctx->cfg.en = false;

	return 0;
}

int usb_dc_ep_flush(const u8_t ep)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	ep_ctx->buf.len = 0;
	ep_ctx->buf.curr = ep_ctx->buf.data;
	ep_ctx->state = EP_IDLE;
	ep_ctx->flags = 0;

	switch (ep_ctx->cfg.type) {
	case USB_DC_EP_CONTROL:
		nrf_usbd_epout_clear(ep);
		break;
	case USB_DC_EP_BULK:
	case USB_DC_EP_INTERRUPT:
		nrf_usbd_epout_clear(ep);
		break;
	default:
		break;
	}

	return 0;
}

int usb_dc_ep_write(const u8_t ep, const u8_t *const data,
		    const u32_t data_len, u32_t * const ret_bytes)
{
	struct nrf5_usbd_ctx *ctx = get_usbd_ctx();
	struct nrf5_usbd_ep_ctx *ep_ctx;
	u32_t bytes_to_copy;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	if (NRF_USBD_EPOUT_CHECK(ep)) {
		return -EINVAL;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	/**
	 * TODO:
	 * With usb_write called multiple times over before the previous
	 * write is complete, there are data corruptions on the bus,
	 * possibly because software over-writes the HW's local buffer
	 * and initiates the next write before or while an ongoing
	 * USB write on the bus.
	 */
	if (ep_ctx->flags & BIT(EP_WRITE_PENDING)) {
		return -EAGAIN;
	}

	k_sem_take(&ctx->dma_in_use, K_FOREVER);

	bytes_to_copy = min(data_len, ep_ctx->cfg.max_sz);
	memcpy(ep_ctx->buf.data, data, bytes_to_copy);
	ep_ctx->buf.len = bytes_to_copy;

	if (ret_bytes) {
		*ret_bytes = bytes_to_copy;
	}

	nrf_usbd_ep_easydma_set(ep, (u32_t)ep_ctx->buf.data, ep_ctx->buf.len);

	switch (ep_ctx->cfg.type) {
	case USB_DC_EP_CONTROL:
	{
		if (bytes_to_copy) {
			start_epin_task(ep);
		} else {
			if (get_usbd_ctx()->address_set) {
				get_usbd_ctx()->address_set = false;
				/**
				 * TODO: For SET_ADDRESS, HW takes care of
				 * initiating STATUS but for some reason
				 * it looks like we need to start ep0status
				 * task. Clarify this!
				 */
				/* break; */
			}
			start_ep0status_task();
			k_sem_give(&ctx->dma_in_use);
			ep_ctx->state = EP_IDLE;
		}
	}
		break;
	case USB_DC_EP_BULK:
	case USB_DC_EP_INTERRUPT:
		/* TODO: Should we set EP_WRITE_PENDING here? */
		start_epin_task(ep);
		break;
	case USB_DC_EP_ISOCHRONOUS:
		start_epin_task(ep);
		break;
	default:
		SYS_LOG_ERR("Invalid endpoint type");
		break;
	}

	return 0;
}

int usb_dc_ep_read_wait(u8_t ep, u8_t *data, u32_t max_data_len,
			u32_t *read_bytes)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;
	u32_t bytes_to_copy;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	if (NRF_USBD_EPIN_CHECK(ep)) {
		return -EINVAL;
	}

	if (!data && max_data_len) {
		return -EINVAL;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	if (!data && !max_data_len) {
		if (read_bytes) {
			*read_bytes = ep_ctx->buf.len;
		}
		return 0;
	}

	bytes_to_copy = min(max_data_len, ep_ctx->buf.len);
	memcpy(data, ep_ctx->buf.curr, bytes_to_copy);
	ep_ctx->buf.curr += bytes_to_copy;
	ep_ctx->buf.len -= bytes_to_copy;

	if (read_bytes) {
		*read_bytes = bytes_to_copy;
	}

	return 0;
}

int usb_dc_ep_read_continue(u8_t ep)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached() || !dev_ready()) {
		return -ENODEV;
	}

	if (NRF_USBD_EPIN_CHECK(ep)) {
		return -EINVAL;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	if (!ep_ctx->buf.len) {
		ep_ctx->buf.curr = ep_ctx->buf.data;

		if (ep_ctx->cfg.type == USB_DC_EP_BULK ||
		    ep_ctx->cfg.type == USB_DC_EP_INTERRUPT) {
			nrf_usbd_epout_clear(ep);
		}
	}

	return 0;
}

int usb_dc_ep_read(const u8_t ep, u8_t *const data,
		   const u32_t max_data_len, u32_t * const read_bytes)
{
	int ret;

	ret = usb_dc_ep_read_wait(ep, data, max_data_len, read_bytes);
	if (ret) {
		return ret;
	}

	ret = usb_dc_ep_read_continue(ep);

	return ret;
}

int usb_dc_ep_set_callback(const u8_t ep, const usb_dc_ep_callback cb)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	ep_ctx->cfg.cb = cb;

	return 0;
}

int usb_dc_set_status_callback(const usb_dc_status_callback cb)
{
	get_usbd_ctx()->status_cb = cb;

	return 0;
}

int usb_dc_ep_mps(const u8_t ep)
{
	struct nrf5_usbd_ep_ctx *ep_ctx;

	if (!dev_attached()) {
		return -ENODEV;
	}

	ep_ctx = endpoint_ctx(ep);
	if (!ep_ctx) {
		return -EINVAL;
	}

	return ep_ctx->cfg.max_sz;
}
